{"intents": [
  {"tag": "greeting",
   "patterns": ["Hi there", "How are you", "Is anyone there?","Hey","Hola", "Hello", "Good day"],
   "responses": ["Hello, thanks for asking", "Good to see you again", "Hi there, how can I help?"],
   "context": [""]
  },
  {"tag": "goodbye",
   "patterns": ["Bye", "See you later", "Goodbye", "Nice chatting to you, bye", "Till next time"],
   "responses": ["See you!", "Have a nice day", "Bye! Come back again soon."],
   "context": [""]
  },
  {"tag": "thanks",
   "patterns": ["Thanks", "Thank you", "That's helpful", "Awesome, thanks", "Thanks for helping me"],
   "responses": ["Happy to help!", "Any time!", "My pleasure"],
   "context": [""]
  },
  {"tag": "noanswer",
   "patterns": [],
   "responses": ["Sorry, can't understand you", "Please give me more info", "Not sure I understand"],
   "context": [""]
  },
  {"tag": "options",
   "patterns": ["How you could help me?", "What you can do?", "What help you provide?", "How you can be helpful?", "What support is offered"],
   "responses": ["I can guide you through Adverse drug reaction list, Blood pressure tracking, Hospitals and Pharmacies", "Offering support for Adverse drug reaction, Blood pressure, Hospitals and Pharmacies"],
   "context": [""]
  },
  {
    "tag": "developmental_disorders",
    "patterns": ["What are developmental disorders?", "Characteristics of persons with developmental disorders", "Example of common developmental disorders"],
    "responses": [
        "Developmental disorders interrupt normal development in childhood and may affect a single area (specific) or several areas (pervasive). For pervasive disorders, early intervention is essential.",
        "For a diagnosis of developmental disabilities, the individual shows functional limitations in three or more categories, including self-care, receptive and expressive language, academic learning, mobility, self-direction, independent living, and economic self-sufficiency.",
        "Examples of common developmental disorders include Mathematics disorder and Stuttering (specific) and Autism, Asperger's, and ADHD (pervasive)."
    ],
    "context": [""]
},
{
    "tag": "treatment_options",
    "patterns": ["Aggressive treatment", "Speech therapy", "Occupational therapy", "Physical therapy", "Behavior modification techniques", "Clay therapy", "Medication"],
    "responses": [
        "Aggressive treatment options for developmental disorders may include speech therapy, occupational therapy, physical therapy, behavior modification techniques, clay therapy, and medication."
    ],
    "context": [""]
},
{
    "tag": "autism",
    "patterns": ["Autism", "Cognitive impairment", "Social impairment", "Repetitive behavior"],
    "responses": [
        "Autism is characterized by cognitive impairment, social impairment, and repetitive behavior. Cognitive impairments include limited ability to understand context, inability to see the big picture, poor generalization and context processing. Positive reinforcement is important for treatment plans. Theory of Mind and executive function are affected. Brain structures affected include the amygdala, hippocampus, basal ganglia, cerebral cortex, cerebellum, corpus callosum, and brain stem. Social impairment includes an inability to maintain joint attention, difficulty interacting with peers, and problems using and interpreting nonverbal cues (e.g., facial expressions). Repetitive behaviors may include hand flapping, whole body movements, and fixation on a particular thing."
    ],
    "context": [""]
},
{
    "tag": "math_disorder",
    "patterns": ["Mathematics disorder", "What is math disorder?", "Math difficulties", "Math learning problems"],
    "responses": [
        "Mathematics disorder, also known as math disorder, refers to difficulties in learning and performing mathematical calculations. It can affect a person's ability to understand and work with numbers. Early intervention and personalized strategies can help individuals with math disorders improve their math skills."
    ],
    "context": [""]
},
{
    "tag": "toilet training",
    "patterns": ["What is the definition of toilet training", "What is toilet training"],
    "responses": ["Toilet training is teaching a young child to use the toilet for urination or defecation."],
    "context": [""]
},
    {
      "tag": "key_steps",
      "patterns": ["What are the key steps in the process of toilet training?"],
      "responses": ["The process involves assessing a child's readiness, gathering information about the child's schedule and elimination habits, preparing necessary materials, scheduling regular sittings, and using a chart to monitor progress."],
      "context": [""]
    },
    {
      "tag": "assess_readiness",
      "patterns": ["How do you assess a child's readiness for toilet training?"],
      "responses": ["Assess a child's readiness by evaluating finger and hand coordination, mobility, bladder control, awareness of the need to relieve oneself, compliance, and the ability to understand and perform multiple steps in a sequence."],
      "context": [""]
    },
    {
      "tag": "gather_info",
      "patterns": ["What information should be gathered during the preparation phase?"],
      "responses": ["Gather information about the child's schedule, preferred timings for toilet training, and elimination habits."],
      "context": [""]
    },
    {
      "tag": "prep_materials",
      "patterns": ["What materials are needed for preparation?"],
      "responses": ["Prepare materials such as loose-fitting shorts, a timer, cloth or wet wipes for cleaning up, and a visual schedule."],
      "context": [""]
    },
    {
      "tag": "scheduled_sittings",
      "patterns": ["What is the significance of scheduled sittings in toilet training?"],
      "responses": ["Scheduled sittings involve bringing the child to the bathroom at regular intervals, predetermined intervals (initially around 30 minutes), and requiring the child to sit at the toilet or potty for about 5-10 minutes."],
      "context": [""]
    },
    {
      "tag": "toileting_sequence",
      "patterns": ["What behaviors are involved in the toileting sequence?"],
      "responses": ["The sequence includes removing shorts, lifting the toilet seat cover, sitting on the toilet seat, praising and rewarding the child for correct elimination, dressing up, washing hands, and continuing with the activity prior to the scheduled sitting."],
      "context": [""]
    },
    {
      "tag": "accident_management",
      "patterns": ["How can accidents during toilet training be managed?"],
      "responses": ["Accident management involves giving verbal disapproval, prompting the child to clean up, changing into a new set of clothes, cleaning up the mess, and continuing with the routine without scolding or nagging."],
      "context": [""]
    },
    {
      "tag": "considerations_accident",
      "patterns": ["What should be considered during accident management?"],
      "responses": ["Use hand-over-hand assistance from behind the child, maintain silence during the procedure, do not make cleaning enjoyable for the child, and avoid scolding or nagging."],
      "context": [""]
    },
    {
      "tag": "visual_schedules",
      "patterns": ["How can visual schedules aid in teaching toileting skills?"],
      "responses": ["Visual schedules display what is happening during an activity, helping decrease anxiety and difficulty with transitions by clearly informing the child when certain activities will occur."],
      "context": [""]
    },
    {
      "tag": "strategies_sensory_issues",
      "patterns": ["What are the key strategies for teaching toileting skills to a child with sensory issues?"],
      "responses": ["Strategies include using appropriate visual schedules, gradually increasing opportunities for reinforcement, managing accidents calmly, and maintaining a positive and supportive environment during the training process."],
      "context": [""]
    }
 
]
}
